{
    "lessons": {
        "L1": {
            "1": {
                "title": "Basic Kana",
                "assignmentCodes": ["J2bWkpcnAl","J25aoOue76D"],
                "length": 2,
                "pages": {
                    "1": "In this lesson, you are going to learn about the basic vowels in Japanese kana. Before moving onto what those specific kana are, lets first go over what exactly kana is. Japanese writing is made up of 3 different character sets: Hiragana, Katakana, and Kanji. The first two, Hiragana and Katakana, are called \"Kana\". Kana can be thought of as the Japanese version of the English Alphabet. Each character is associated with a specific sound. \nYou may be wondering, why are there two different kana if it's like our alphabet? The answer is that Hiragana is used for native Japanese words, such as \"ありがとう(A•ri•ga•to•o/Thank you)\", while Katakana is used for foreign words, such as \"コーヒー(Ko•o•hi•i/Coffee)\". You may have been able to tell from just those examples, but Hiragana looks a lot more curvy than Katakana does generally. This is an easy way to tell them apart as you begin learning them. In this class, you will be learning Hiragana and Katakana together, at the same time. The third character set, Kanji, will be taught much later in this course, so do not worry about that for now.",
                    "2": "When writing in Japanese, it is important that you pay attention to two things: Stroke Order & Stroke Ending. Every Japanese character should be written from **left to right or top to bottom**. Writing Japanese characters in this order will also help you write with the proper stroke endings. There are 3 different types of stroke endings in Japanese, the \"stop\", \"hook\", and \"release\"{{https://media.discordapp.net/attachments/1075740519352778792/1075988830290718720/Stroke_Order.jpg}}",
                    "3": "Now that you have a good idea on what kana is, the first ones you will be learning are the vowels. Japanese vowels are as follows: `A` `I` `U` `E` `O`. `A` is pronounced like \"ah\", `I` is pronounced as \"ee\", like the ee in \"Cheese\". `U` is pronounced as \"oo\", like in \"Boo\". `E` is pronounced as \"eh\", and `O` is pronounced as \"oh\". These are the basic vowels that make up most of the sounds that you'll hear throughout the various kana. Almost all other sounds you'll hear throughout kana will be consonants that are paired up with one of these 5 vowels. So how do you write these vowels in Japanese? Let's start with the Hiragana version. You will use these vowels inside of native Japanese words:\n`あ(A) い(i) う(U) え(E) お(O)`\nNow time for the Katakana version. You will use these vowels to form foreign words:\n`ア(A) イ(I) ウ(U) エ(E) オ(O)`\nYour very first assignment will be focused on these vowels here. Please use the /quiz command to quiz yourself on hiragana and katakana (beginner difficulty). Aside from these vowels, there is actually one consonant that stands by itself that you will also be tested on. That would be `N`. Hiragana: `ん`, Katakana: `ン`. This is the only consonant in Japanese that stands by itself.",
                    "4": "The length of this lesson is **2 days**. What that means is, you will not be able to progress through this lesson for two days. Once 2 days has passed from unlocking this lesson, you may then finish the assignment for this section to progress through the class. Use this time to study what you have learned. Practice your strokes, writing these hiragana and katakana in their proper stroke order, then use the /assignment command to pass this lesson. Your assignment code is `J2bWkpcnAl`. Below are some resources you could use to learn more about these kana:\nhttps://www.youtube.com/watch?v=RPAaIyFpKG0\nhttps://www.youtube.com/watch?v=yGRjcdyIIgs"
                },
                "assignments": {
                    "J2bWkpcnAl": "Write あいうえおん & アイウエオン 10 times on a piece of paper and upload it",
                    "J25aoOue76D": "Type out a 4-10 sentence summary of this video: https://www.youtube.com/watch?v=I34W3FLV114"
                }
            },
            "2": {
                "title": "K, G, Syllables, Dakuten, and Handakuten",
                "assignmentCodes": ["HJangs7098amE", "HJi83nnJa06s", "HJsd879hNyg"],
                "length": 2,
                "pages": {
                    "1": "Now that you've learned about the basic vowels in kana, let's begin exploring the Japanese consonants! We are going to start with the hiragana and katakana for `K` and `G` sounds. Before going over exactly what they are, however, let's go over diacritical marks. In both Hiragana and Katakana, there are 46 basic characters. Some of these characters can be modified with diacritical marks called Dakuten and Handakuten.\nThe most common mark you'll see is Dakuten, which looks like this: `゛` These can be added to the end of several of the basic 46 kana to give it a different pronunciation. For example, if you were to add a dakuten to `か (Ka)` it becomes `が (Ga)`. The other type of diacritical mark is called Handakuten. This symbol looks like a little circle that will be to the top right of the character it is modifying. For example, `は (Ha)` would become `ぱ (Pa)`. Currently, the only sound that you can make with handakuten are the \"P\" characters that you get from modifying the \"H\" characters.",
                    "2": "Now that we've gone over the diacritical marks, lets dive a bit deeper into understanding how Japanese syllables work. You can think of every single character as it's own syllable. Japanese is meant to be spoken at a consistent speed, so understanding this concept is incredibly important. To help illustrate the different syllables in words, you are going to see things like your required vocabulary typed in Romaji for now, until you become more comfortable with the language. Romaji, is just the term that we used to described \"Romanized\" Japanese, or Japanese typed with English characters. Besides your required vocabulary is where you will find the romaji versions of words. An example of a romaji word is `Arigatoo`, the romaji for `ありがとう`. Take a look at that specific example, you will find a common practice when translating to Hiragana within it. In our romaji, we used 2 `O`s at the end of the word, but the hiragana for the final `O` sound is actually `う (U)`. It will still, however, be pronounced more as a long `O` sound.\nWhenever you see two vowels next to each other, that means that you need to pronounce it as two syllables. Remember, everything in Japanese should be spoken at a consistent rate. Each of your syllables should be equal in length when being pronounced, and, unlike how we speak in English, we would count those two vowel sounds as two different syllables. Another popular example is the Japanese word: `さようなら (Sayoonara)` - Farewell. In this case, it would be pronounced as `Sa•Yo•O•Na•Ra`. One more Hiragana example would be `おかあさん (Okaasan)` - Mother.\nWhile, in Hiragana, you are supposed to write long vowel sounds with their corresponding characters (あいうえお), it works a little bit differently in Katakana. In the Katakana system, it is simplified by simply using the `ー` character. No need to type the corresponding vowel character when using Katakana. One example of this would be the Japanese word for Coffee: `コーヒー (Ko•O•Hi•I)`.",
                    "3": "Let's go over this lesson's characters:\nHiragana: `か(Ka) き(Ki) く(Ku) け(Ke) こ(Ko) が(Ga) ぎ(Gi) ぐ(Gu) げ(Ge) ご(Go)`\nKatakana: `カ(Ka) キ(Ki) ク(Ku) ケ(Ke) コ(Ko) ガ(Ga) ギ(Gi) グ(Gu) ゲ(Ge) ゴ(Go)`\nLets also go over some words that you can write out as well and will need to study up on for this lessons' assignments: \n`こい (Koi)` - Carp\n`おか (Oka)` - Hill\n`いけ (Ike)` - Pond\n`うえ (Ue)` - Above\n`あき (Aki)` - Autumn\n`かく (Kaku)` - Write\n`オーケー (Ookee)` - Okay\n`コーク (Kooku)`\n`ウエア (Uea)` - Wear\n`ケーキ (Keeki)` - Cake\n`キウイ (Kiui)` - Kiwifruit\n`ココア (kokoa)` - Cocoa\nYour assignment codes are `HJangs7098amE`. The length of this lesson is 2 days."
                },
                "assignments": {
                    "HJangs7098amE": "Write かきくけこ,がぎぐげご & カキクケコ,ガギグゲゴ 10 times on a piece of paper and upload it.",
                    "HJi83nnJa06s": "Write the following romaji words into their hiragana or katakana versions 5 times.\nKoi, Oka, Ike, Ue, Aki, Kaku, Ookee, Kooku, Uea, Keeki, Kiui, Kokoa",
                    "HJsd879hNyg": "Watch these two Youtube videos and write a 6-14 sentence summary on them:\nhttps://www.youtube.com/watch?v=1M5p-H_PYeE&list=UUjRZpOiz3vjXNqAyjcIGwEw\nhttps://www.youtube.com/watch?v=PaKeNLkUUWw"
                }
            },
            "3": {
                "title": "T & S",
                "assignmentCodes": [],
                "length": 1,
                "Pages": {
                    "1"
                }
            }
        }
    }
}