{
    "lessons": {
        "L1": {
            "1": {
                "title": "Basic Kana",
                "assignmentCodes": [
                    "{WT}J2bWkpcnAl",
                    "{VD}J25aoOue76D"
                ],
                "length": 2,
                "pages": {
                    "1": "We are starting this course off with a very short lesson to get you ready for what's coming. In this lesson, you are going to learn about the basic vowels in Japanese kana. Before moving onto what those specific kana are, lets first go over what exactly kana is. Japanese writing is made up of 3 different character sets: Hiragana, Katakana, and Kanji. The first two, Hiragana and Katakana, are called \"Kana\". Kana can be thought of as the Japanese version of the English Alphabet. Each character is associated with a specific sound. \nYou may be wondering, why are there two different kana if it's like our alphabet? The answer is that Hiragana is used for native Japanese words, such as \"ありがとう(A•ri•ga•to•o/Thank you)\", while Katakana is used for foreign words, such as \"コーヒー(Ko•o•hi•i/Coffee)\". You may have been able to tell from just those examples, but Hiragana looks a lot more curvy than Katakana does generally. This is an easy way to tell them apart as you begin learning them. In this class, you will be learning Hiragana and Katakana together, at the same time. The third character set, Kanji, will be taught much later in this course, so do not worry about that for now.",
                    "2": "When writing in Japanese, it is important that you pay attention to two things: Stroke Order & Stroke Ending. Every Japanese character should be written from **left to right or top to bottom**. Writing Japanese characters in this order will also help you write with the proper stroke endings. There are 3 different types of stroke endings in Japanese, the \"stop\", \"hook\", and \"release\"{{https://media.discordapp.net/attachments/1075740519352778792/1075988830290718720/Stroke_Order.jpg}}",
                    "3": "Now that you have a good idea on what kana is, the first ones you will be learning are the vowels. Japanese vowels are as follows: `A` `I` `U` `E` `O`. `A` is pronounced like \"ah\", `I` is pronounced as \"ee\", like the ee in \"Cheese\". `U` is pronounced as \"oo\", like in \"Boo\". `E` is pronounced as \"eh\", and `O` is pronounced as \"oh\". These are the basic vowels that make up most of the sounds that you'll hear throughout the various kana. Almost all other sounds you'll hear throughout kana will be consonants that are paired up with one of these 5 vowels. So how do you write these vowels in Japanese? Let's start with the Hiragana version. You will use these vowels inside of native Japanese words:\n`あ(A) い(i) う(U) え(E) お(O)`\nNow time for the Katakana version. You will use these vowels to form foreign words:\n`ア(A) イ(I) ウ(U) エ(E) オ(O)`\nYour very first assignment will be focused on these vowels here. Please use the /quiz command to quiz yourself on hiragana and katakana (beginner difficulty). Aside from these vowels, there is actually one consonant that stands by itself that you will also be tested on. That would be `N`. Hiragana: `ん`, Katakana: `ン`. This is the only consonant in Japanese that stands by itself.",
                    "4": "The length of this lesson is **2 days**. What that means is, you will not be able to progress through this lesson for two days. Once 2 days has passed from unlocking this lesson, you may then finish the assignment for this section to progress through the class. Use this time to study what you have learned. Practice your strokes, writing these hiragana and katakana in their proper stroke order, then use the /assignment command to pass this lesson. Your assignment codes are `{WT}J2bWkpcnAl` and `{VD}J25aoOue76D`. Below are some resources you could use to learn more about these kana:\nhttps://www.youtube.com/watch?v=RPAaIyFpKG0\nhttps://www.youtube.com/watch?v=yGRjcdyIIgs"
                },
                "assignments": {
                    "{WT}J2bWkpcnAl": "Write あいうえおん & アイウエオン 10 times on a piece of paper and upload it",
                    "{VD}J25aoOue76D": "Type out a 4-10 sentence summary of this video: https://www.youtube.com/watch?v=I34W3FLV114"
                }
            },
            "2": {
                "title": "K, G, Syllables, Dakuten, and Handakuten",
                "assignmentCodes": [
                    "{WT}HJangs7098amE",
                    "{WT}HJi83nnJa06s",
                    "{VD}HJsd879hNyg"
                ],
                "length": 2,
                "pages": {
                    "1": "Now that you've learned about the basic vowels in kana, let's begin exploring the Japanese consonants! We are going to start with the hiragana and katakana for `K` and `G` sounds. Before going over exactly what they are, however, let's go over diacritical marks. In both Hiragana and Katakana, there are 46 basic characters. Some of these characters can be modified with diacritical marks called Dakuten and Handakuten.\nThe most common mark you'll see is Dakuten, which looks like this: `゛` These can be added to the end of several of the basic 46 kana to give it a different pronunciation. For example, if you were to add a dakuten to `か (Ka)` it becomes `が (Ga)`. The other type of diacritical mark is called Handakuten. This symbol looks like a little circle that will be to the top right of the character it is modifying. For example, `は (Ha)` would become `ぱ (Pa)`. Currently, the only sound that you can make with handakuten are the \"P\" characters that you get from modifying the \"H\" characters.",
                    "2": "Now that we've gone over the diacritical marks, lets dive a bit deeper into understanding how Japanese syllables work. You can think of every single character as it's own syllable. Japanese is meant to be spoken at a consistent speed, so understanding this concept is incredibly important. To help illustrate the different syllables in words, you are going to see things like your required vocabulary typed in Romaji for now, until you become more comfortable with the language. Romaji, is just the term that we used to described \"Romanized\" Japanese, or Japanese typed with English characters. Besides your required vocabulary is where you will find the romaji versions of words. An example of a romaji word is `Arigatoo`, the romaji for `ありがとう`. Take a look at that specific example, you will find a common practice when translating to Hiragana within it. In our romaji, we used 2 `O`s at the end of the word, but the hiragana for the final `O` sound is actually `う (U)`. It will still, however, be pronounced more as a long `O` sound.\nWhenever you see two vowels next to each other, that means that you need to pronounce it as two syllables. Remember, everything in Japanese should be spoken at a consistent rate. Each of your syllables should be equal in length when being pronounced, and, unlike how we speak in English, we would count those two vowel sounds as two different syllables. Another popular example is the Japanese word: `さようなら (Sayoonara)` - Farewell. In this case, it would be pronounced as `Sa•Yo•O•Na•Ra`. One more Hiragana example would be `おかあさん (Okaasan)` - Mother.\nWhile, in Hiragana, you are supposed to write long vowel sounds with their corresponding characters (あいうえお), it works a little bit differently in Katakana. In the Katakana system, it is simplified by simply using the `ー` character. No need to type the corresponding vowel character when using Katakana. One example of this would be the Japanese word for Coffee: `コーヒー (Ko•O•Hi•I)`.",
                    "3": "Let's go over this lesson's characters:\nHiragana: `か(Ka) き(Ki) く(Ku) け(Ke) こ(Ko) が(Ga) ぎ(Gi) ぐ(Gu) げ(Ge) ご(Go)`\nKatakana: `カ(Ka) キ(Ki) ク(Ku) ケ(Ke) コ(Ko) ガ(Ga) ギ(Gi) グ(Gu) ゲ(Ge) ゴ(Go)`\nLets also go over some words that you can write out as well and will need to study up on for this lessons' assignments: \n`こい (Koi)` - Carp\n`おか (Oka)` - Hill\n`いけ (Ike)` - Pond\n`うえ (Ue)` - Above\n`あき (Aki)` - Autumn\n`かく (Kaku)` - Write\n`オーケー (Ookee)` - Okay\n`コーク (Kooku)`\n`ウエア (Uea)` - Wear\n`ケーキ (Keeki)` - Cake\n`キウイ (Kiui)` - Kiwifruit\n`ココア (kokoa)` - Cocoa\nYour assignment codes are `{WT}HJangs7098amE`, `{WT}HJi83nnJa06s`, and `{VD}HJsd879hNyg`. The length of this lesson is 2 days."
                },
                "assignments": {
                    "{WT}HJangs7098amE": "Write かきくけこ,がぎぐげご & カキクケコ,ガギグゲゴ 10 times on a piece of paper and upload it.",
                    "{WT}HJi83nnJa06s": "Write the following romaji words into their hiragana or katakana versions 5 times:\nKoi, Oka, Ike, Ue, Aki, Kaku, Ookee, Kooku, Uea, Keeki, Kiui, Kokoa",
                    "{VD}HJsd879hNyg": "Watch these two Youtube videos and Type a 6-14 sentence summary on them in English:\nhttps://www.youtube.com/watch?v=1M5p-H_PYeE&list=UUjRZpOiz3vjXNqAyjcIGwEw\nhttps://www.youtube.com/watch?v=PaKeNLkUUWw"
                }
            },
            "3": {
                "title": "T, D, S, Z, & Required Vocab",
                "assignmentCodes": [
                    "{WT}nMo82bHa9L00",
                    "{WT}nMJbn3Ll1k9v",
                    "{VD}nMbaL4tbn23k",
                    "{WT}nMbIuyasb1Jn"
                ],
                "length": 3,
                "Pages": {
                    "1": "In this lesson, you are going to be introduced to the characters for `T`, `D`, `S`, and `Z`. These sounds are a little bit different from what you may be expecting, so lets start with `S`.\nThe `S` hiragana characters are as follows: `さ(Sa) し(Shi) す(Su) せ(Se) そ(So)` As you can see, we are thrown a curveball with `し`. It is pronounced as `Shi` instead of what you may have expected, `Si`.\nThe Katakana version of the S characters are `サ(Sa) シ(Shi) ス(Su) セ(Se) ソ(So)`. Now, let's move onto the T's.\nHiragana: `た(Ta) ち(Chi) つ(Tsu) て(Te) と(To)`\nKatakana: `タ(Ta) チ(Chi) ツ(Tsu) テ(Te) ト(To)`\nAs you can see, this one is another curveball. Instead of something like `Ti`, and `Tu`, we get `Chi` and `Tsu`. Now that we've got T & S out of the way, D & Z are easy, as they are just the T & S characters, but with dakuten added to them. The D characters are derived from the T characters, and the Z characters are derived from the S characters. Something to keep in mind with these, is that `Di` and `Du`, are actually pronounced as `Ji` and `Zu`. As for the Z sounds, they are pronounced as follows: `Za **Ji** **Zu** Ze Zo`.\nAs you can see, that's *two different* `Ji` and `Zu` sounds... That is not a mistake, they are actually pronounced the same in Japanese, but they are used differently. Generally speaking, you are going to see the Z version of `Ji`(じ & ジ) and `Zu`(ズ & ず) a lot more than you'll see the D version of `Ji`(ぢ & ヂ) and `Zu`(づ & ヅ). So where will you see them? You will generally see the D versions of `Ji` and `Zu` when they're paired with repeated sounds. Examples of this would be `つづき (Tsuzuki)` and `ちぢみ (Chijimi)`. Other than that, you will more than likely see the `Z` versions of these sounds.",
                    "2": "As with every kana lesson, here are some vocabulary words you'll need to learn to help with learning these new kana!\n`とし (Toshi)` - Age\n`せかい (Sekai)` - World\n`たすけ (Tasuke)` - Help\n`ちかてつ (Chikatetsu)` - Subway\n`かさ (Kasa)` - Umbrella\n`あそこ (Asoko)` - Over There\n`スーツ (Suutsu)` - Suit\n`シーザー (Shiizaa)` - Caesar\n`タコス (Takosu)` - Tacos\n`チーズ (Chiizu)` - Cheese\n`タイ (Tai)` - Thailand\n",
                    "3": "Your next lesson is going to be your very first grammar lesson! Because we are starting to get into grammar, you are going to need to learn some additional words. These words specifically will be used heavily throughout *all of L1*.\n1.Now - `いま (Ima)`\n2.English (language) - `えいご (Eego)`\n3.Student - `がくせい (Gakusee)`\n4.Japan - `にほん (Nihon)`\n5.Japanese (language) - `にほんご (Nihongo)`\n6.Japanese people - `にほんじん (Nihonjin)`\n7.High school - `こうこう (Kookoo)`\n8.P.M. - `ごご (Gogo)`\n9.A.M. - `ごぜん (Gozen)`\n10. ... years old. - `...さい (...Sai)`\n11. Mr./Ms./Mrs. - `...さん (...San)`\n12. O’clock - `...じ (...Ji)`\n13. Major - `せんこう (Senkoo)`\n14. Teacher - `せんせい (Sensee)`\n15. That is right. - `そうです (Soo Desu)`\n16. I see; Is that so? - `そうですか (Soo Desu Ka)`\n17. College/University - `だいがく (Daigaku)`\n18. Telephone - `でんわ (Denwa)`\n19. Friend - `ともだち (Tomodachi)`\n20. Name - `なまえ (Namae)`\n21. What - `なん / なに (Nan/Nani)`\n22. First year student - `いちねんせい (Ichinensee)`\n23. Yes - `はい (Hai)`\n24. Half past two - `にじはん`\n25. International student - `りゅうがくせい (Ryuugakusee)`\n26. I - `わたし (Watashi)`\n27. China - `ちゅうごく (Chuugoku)`\n28. Korea - `かんこく (Kankoku)`\n29. College/University student - `だいがくせい (Daigakusee)`\n30. Mother - `おかあさん (Okaasan)`\n31. Father - `おとうさん (Otoosan)`\n32. Older sister - `おねえさん (Oneesan)`\n33. Older brother - `おにいさん (Oniisan)`\n34. Younger sister - `いもうと (Imooto)`\n35. Younger brother - `おとうと (Otooto)`",
                    "4": "The length of this lesson is 3 days. Your assignment codes are `{WT}nMo82bHa9L00`, `{WT}nMJbn3Ll1k9v`, `{WT}nMbIuyasb1Jn`, and `{VD}nMbaL4tbn23k`."
                },
                "assignments": {
                    "{WT}nMo82bHa9L00": "Write たちつてと,だぢづでど,さしすせそ, and ざじずぜぞ 10 times on a piece of paper and upload it.",
                    "{WT}nMJbn3Ll1k9v": "Write the following romaji words into their hiragana or katakana versions 3 times:\nToshi, Sekai, Tatsuke, Chikatetsu, Kasa, Asoko, Suutsu, Shiizaa, Takosu, Chiizu, and Tai",
                    "{WT}nMbIuyasb1Jn": "Write the following required vocabulary in Japanese (Hiragana) 5 times:\nNow, English (language), Student, Japan, Japanese (language), Japanese people, High School, P.M., A.M., ... Years Old, Mr. / Mrs. / Ms., O'Clock, Major, Teacher, That is right., I see; Is that so?, College/University, Telephone, Friend, Name, What, First Year Student, Yes, Half Past Two, International Student, I, China, Korea, College/University Student, High School Student, Mother, Father, Older Sister, Older Brother, Younger Sister, Younger Brother",
                    "{VD}nMbaL4tbn23k": "Watch the Youtube video linked below, and Type a 4-10 sentence summary on it in English:\nhttps://www.youtube.com/watch?v=xdOZbvTWJ5s"
                }
            },
            "4": {
                "title": "X は Y です, か, ね, H, B, P, M, and Honorifics",
                "assignmentCodes": ["{WT}lOhnoa9987af", "{VD}lO7gk2lbkzd8", "{VD}lOf6k3vrbe89", "{WT}lO0ag5vmsd91"],
                "length": 3,
                "Pages": {
                    "1": "Before we get into forming basic sentences in Japanese, lets first take a look at something incredibly important, honorifics. Honorifics exist in both English and Japanese. In English, an example of an honorific would be `Mr.`, `Ms.`, and `Mrs.`. In English, they are used to address somebody in a polite manner, and Japanese uses these as well, albeit in a different way. In Japanese, most honorifics will *suffix* the name, instead of *prefix* the name, and those are the ones that we will be focusing on in this lesson. Another way that Japanese differs from English, is that honorifics can and are often used in both polite *and* casual language. The most common honorific that you will hear and use in Japanese is `さん (San)`. For example, my name is `タナー (Tanaa)`. If we were to meet each other in Japan, you would address me as `タナーさん (Tanaasan)`. This honorific is the most common because it's generally used as a respectful way to address people that you don't have a close relationship with. So, you would often use さん for those who you're meeting for the first time, friends of friends, and just people who you do not know very well. Keep in mind, that さん is also generally used regardless of age and gender.",
                    "2": "Before moving onto the next honorific, let's go ahead and explain how names in Japanese work. Japanese people, just like us English speakers, have first and last names. In English, your \"first name\" is your given name. The name that your parents choose for you. Your \"last name\" is your surname, or the name of your family. In Japanese, these are reversed. Japanese naming conventions dictate that the order of their name be `[Surname] [Given name]`. So, if your given name is `たけし (Takeshi)`, and your surname is `みやもと (Miyamoto)`, people will generally refer to you as `みやもと (Miyamoto)`. This is the respectful way to address people in Japan. **It is only fine to address people by their given name when you are friends or family**. The one exception to this rule, may be when you are speaking to foreigners where it's still polite to use given names. If you are American, Japanese people may still address you with your given name. This is not a sign of disrespect, this is them trying to show respect for your culture.",
                    "3": "The next honorific we're looking at is `ちゃん (Chan)`. `ちゃん` is considered an informal/casual honorific. This one is generally used for addressing girls that you are close with, children, and people and pets that you think are cute. It's also common for girls to use this honorific with their female friends. Some people may also use this to address their grandparents, but the general rule is to not use this honorific for addressing older people, as it could come off as rude. Another common thing you'll see with this honorific is the shortening of names. For example, if somebody were to address me with `ちゃん`, they could say `タナーちゃん (Tanaachan)`, or even shorten my name by taking off a syllable with `タちゃん (Tachan)`. It is very common for partners to use this honorific to address each other, regardless of gender. As an extension of `ちゃん`, you might have also heard of the honorific `たん (Tan)`. `たん` is considered to be just a cuter way to say `ちゃん`, but to most people it sounds *too over the top* to be used seriously, and may even make you come off as creepy. It's most often used in a joking manner.",
                    "4": "The most formal and polite of honorifics in Japan is `さま (Sama)`. This is what you will use to refer to gods, use in business situations, people of higher status or rank, and you will hear this honorific a lot in the customer service industry. In the customer service industry, they often tell employees to treat their customers like gods, so that is why you may be addressed with the `さま` honorific. This is how you show your utmost respect for somebody. Another very respectful honorific would be `せんせい (Sensee)`. This one is often used as a noun as well, where people will drop the person's name completely and address them simply as `せんせい`. You use this honorific to address teachers mostly, however, it's also commonly used for doctors, politicians, and lawyers. You could also use this honorific to address people who are masters of a specific skill. The reason for this being that `せんせい` can be translated to `honorable master`. It is a way to show respect for somebody who could be a master of something. However, if you yourself were a teacher or very skilled in something, it would come off as arrogant to use `せんせい` to describe yourself. In this case, you would be better off using a noun like `きょうし (Kyooshi)` to describe yourself. `きょうし` can be translated to `Teacher`. The next few are `こうはい (Koohai)` and `せんぱい (Senpai)`. `こうはい` means `Underclassman`, and `せんぱい` means `Upperclassman`. `こうはい`, however, is generally not used as an honorific. You will almost never hear upperclassmen use this to address their underclassmen. You will, however, hear `せんぱい` used often to address upperclassman. `せんぱい` is also not just used in school environments, it can also be used in work environments to address coworkers who have been working a particular job longer than you have. The last honorific we'll be looking at in this lesson is `くん (Kun)`. `くん` is used to refer to males that are younger or the same age as the speaker. This honorific is considered to be a more casual honorific than something like `さん`, so you'll most likely hear this honorific being used to address males in casual workplace and school settings. This honorific is also used often by females to show affection for their male partners.",
                    "5": "Now that we've finished going over the basic honorifics in Japanese, lets get into our first particle of the course, `は`! More specifically, we'll be looking at the sentence `X は Y です。`. What is a particle though? A particle in Japanese is some kind of character that is most often used to mark something before it. In our example, `は` is used to mark `X`. `は` is the hiragana for `Ha`. Normally, that is exactly how you would pronounce it, but not when it is used as a particle. When `は` is used as a particle, it should be pronounced `Wa`. This particle is the topic marker particle, which means that in our example sentence above, `X` would be the topic. It can be interpreted as saying something like `As for X,[...]` or `Speaking of X,[...]`. You are stating what the topic of the sentence is going to be. A common mistake that beginners make is thinking that `X は Y` means `X is Y`. That is wrong, and thats where the last part of our example sentence comes into play. The word `です (Desu)` means `it is`. So, in our example sentence `X は Y です。`, it can be translated to `As for X, it is Y.`. A side note about `です`: When a word in Japanese ends with `す`, you generally do not pronounce the `U` sound. So `です` is pronounced `Des`. Another example would be `タナーさんはアメリカじんです。 (Tanaasan Wa Amerikajin Desu.)`, which could be translated to `Speaking of Tanner, he is American.`. If I were trying to tell you my name, I might say something like `わたしはタナーです。 (Watashi Wa Tanaa Desu.)`, which could be translated to `I am Tanner.`.{{Insert image link here}}",
                    "6": "Now that you've learned how to form a basic statement question, let's modify that sentence slightly to form a few different questions. Let's start with the `か` particle. `か` can be thought of as the question mark of formal Japanese. With that in mind, all we have to do in order to turn `X は Y です` into a question, is add that particle to the end of it, like `X は Y ですか`. It should be noted, however, that there should be a tone intonation at the end of the sentence as well, just like how you would voice a question in English. So, using our last example, `タナーさんはアメリカじんですか`, would translate to `Speaking of Tanner, is he American?`. Another way we can ask a question in Japanese is by using the `ね` particle. This particle works the same exact way as the `か` particle does, but it's got a different meaning. Whereas `X は Y ですか` would mean `As for X, is it Y?`, `X は Y ですね` means `As for X, it is Y, right?`. So `ね` could be translated literally to something like `[...], right?`. `タナーさんはアメリカじんですね` would mean `Speaking of Tanner, he's American, right?`.",
                    "7": "Let's look at a conversation between two people. The first person will be named `タナー`, and the second person will be named `みやもと`.\n**みやもと**: なまえはなんですか。(Namae wa nan desu ka?)\n**タナー**: わたしはタナーです。(Watashi wa Tanaa desu.)\n**みやもと**: がくせいですね。(Gakusee desu ne?)\n**タナー**: そうです。せんこうはにほんごです。(Soo desu. Senkoo wa nihongo desu.)\n**みやもと**: なねんせいですか。(Nanensee desu ka?)\n**タナー**: いちねんせいです。(Ichinensee desu.)\nThe above conversation could be translated as follows:\n**Miyamoto**: What is your name?\n**Tanner**: I am Tanner.\n**Miyamoto**: You're a student, right?\n**Tanner**: That's right. My major is Japanese language.\n**Miyamoto**: What year are you in college?\n**Tanner**: I'm a first year student.",
                    "8": "Now that we've done a bit of grammar, it's time to learn some new kana! This lesson, we'll be learning the kana for H, B, and P, the hiragana are as follows\n**H**: `は(Ha) ひ(Hi) ふ(Fu) へ(He) ほ(Ho)`\n**B**: `ば(Ba) び(Bi) ぶ(Bu) べ(Be) ぼ(Bo)`\n**P**: `ぱ(Pa) ぴ(Pi) ぷ(Pu) ぺ(Pe) ぽ(Po)`\n**M**: `ま(Ma) み(Mi) む(Mu) め(Me) も(Mo)`\nKeep in mind, that with `ふ`, this is *supposed* to be pronounced as `Fu`, not `Hu`. Now, let's move onto the Katakana versions!\n**H**: `ハ(Ha) ヒ(Hi) フ(Fu) ヘ(He) ホ(Ho)`\n**B**: `バ(Ba) ビ(Bi) ブ(Bu) ベ(Be) ボ(Bo)`\n**P**: `パ(Pa) ピ(Pi) プ(Pu) ペ(Pe) ポ(Po)`\n**M**: `マ(Ma) ミ(Mi) ム(Mu) メ(Me) モ(Mo)`\nThere is not any vocabulary for this kana lesson, though your next kana lesson will have more vocabulary for you to practice! The length of this lesson is 3 days."
                },
                "assignments": {
                    "{WT}lOhnoa9987af": "Write ハヒフヘホ,　バビブベボ, パピプペポ, マミムメモ, はひふへほ, ばびぶべぼ, ぱぴぷぺぽ, and まみむめも 10 times on a piece of paper and upload it.",
                    "{VD}lO7gk2lbkzd8": "Watch this youtube video linked below, and write a 6-12 sentence summary in English\nhttps://www.youtube.com/watch?v=iHqZJ_1uZoU",
                    "{VD}lOf6k3vrbe89": "Watch this youtube video linked below, and write a 6-12 sentence summary in English\nhttps://www.youtube.com/watch?v=N6dq2TxcMpk",
                    "{WT}lO0ag5vmsd91": "Answer the following questions on a piece of paper and upload it.\n1. Which honorific would you use to address a random person that you just met on the street? Write in hiragana\n2. Which honorific might somebody use to describe their little sister? Write in hiragana\n3. Which honorific is most often used to refer to gods? Write in hiragana\n4. How do you say `I am an international student` in Japanese? Write in hiragana\n5. Translate `As for Miyamoto, he is Japanese` to Japanese. Write in hiragana\n6. What does the `は` particle mean?\n7. What do the `か` and `ね` particles mean? How are they different?\n8. You've been working at a company for 5 years, and you get a new employee who works in the same department as you do. What would this new employee address you as? Write the honorific in Hiragana.\n9. Which name comes first in Japanese culture? The given name, or the surname? Which name would you use for people you just met, and which name would you use for people you are close friends with? Write in English.\n10. What does `です` mean? How do you pronounce it?"
                }
            },
            "5": {
                "title": "Numbers, N, W, Y, Double Consonants, & Daily Expressions",
                "assignmentCodes": [],
                "length": 3,
                "Pages": {
                    "1": "Before we get into learning the japanese nuber system, let's first learn about some daily expressions that you will hear very often in Japan! The first expression we will learn is `おはようございます。 (Ohayoo Gozaimasu)`. This phrase means `Good morning.`. This is actually the formal/polite way to say it. When speaking casually, meaning you're using the person's given name instead of their surname, you can actually drop the `ございます` entirely and just say `おはよう`. It's not uncommon for Japanese people to use this at times other than the morning when it's the first time they've seen you all day. Our next expressions are `こんばんは (Konban wa)` and `こんにちは (Konnichi wa)`. These two are a little bit odd. `こんばんは` means `Good evening` and `こんいちは` means `Good afternoon`. You may be a bit confused at the pronunciation, and understandably so. It is important to remember that these are not single words by themselves and they are, in fact, phrases composed of a word and the `は` particle. It is common to use them in this way without saying anything after the `は` particle. Please remember to use `は` instead of `わ` when writing these phrases. You may have heard that `こんにちは` is a popular greeting in Japanese, but it actually is not commonly used in Japanese. `こんいち (Konnichi)` is a very old word that can be translated literally to `Today`, and as such, it is mainly reserved for very formal settings and speeches. You may hear politicians use this in their speeches, but you won't really ever use this to greet someboody. The next phrase on our list is `さようなら (Sayoonara)`. This phrase can be translated to `Goodbye`, however, keep in mind that this word sounds very dramatic. When japanese people say `さようなら`, it's usually only used for when they're not going to see the other person for a long time. There are other ways that you could say bye to somebody in casual and formal settings. `じゃあまた。 (Jaa mata.)` is a way to say goodbye to somebody casually and much more common. You should use this with your friends/people you address by their given name. If you are in a more formal setting, like saying bye to your new coworker, you may want to use something like `しつれいします (Shitsureeshimasu)`. Next up is `いいえ (Iie)`. This word has a few different meanings. It could mean `No`, `Don't mention it`, or `You're welcome`. The reason why this `No` could also mean `You're welcome`, is because you are essentially telling the listener that they don't need to be thankful for what you did for them.",
                    "2": "`すみません (Sumimasen)` is our next phrase. Like `いいえ`, it can have multiple meanings depending on the context. It is commonly used to say things like `Excuse me` in the sense that you're trying to get somebody's attention, `I'm sorry`, and it could even be used to say `Thank you`. The way you say `Goodnight` in Japanese is `おやすみなさい (Oyasuminasai)`. If you want to say thank you to somebody, You can use `ありがとうございます (Arigatoo Gozaimasu)`. Just like with `おはよう`, you can drop the `ございます` entirely if you're talking to somebody that you address by their given name. `いってきます (Itte Kimasu)` means `I'll go and come back`. This is most commonly used between family members. The family member that leaves will say `いってきます`, and the others will respond with `いってらっしゃい (Itterasshai)`, which means `Please go and come back`. You may have noticed that there is a small `つ` in there, but it doesn't seem to be voiced. This is because the small `つ` has a different meaning. As you can see, there are two different `Tsu`s we can use (つ vs. っ). The big one, which means `Tsu`, and then the small one, which means `The character after this one is a double consonant`. Because it indicates a double consonant, that means that there should be a slight pause when moving onto the consonant in front of it. Like the word above, `いって (Itte)`, there should be a slight pause in between `い` and `て`. Anyways, back to our basic phrases. When the family member gets back home, they may say something like `ただいま (Tadaima)`, which means `I'm home`, and the family members may respond with `おかえりなさい (Okaerinasai)`, which means `Welcome home`.",
                    "3": "Before you start eating something, you want to thank people for the meal. In this case, you would use `いただきます (Itadakimasu)`, which means `Thank you for the meal`. Keep in mind, that you only use this phrase **before** eating the food. When you're done eating your food, you should say `ごちそうさまでした (Gochisoosamadeshita)`, which also means `Thank you for the meal`, but it's used for when you're done eating. If you want to ask somebody how they're doing, you could say `はじめまして (Hajimemashite)`, which translates literally to `How do you do?`. To say `Nice to meet you`, you would normally use `よろしくおねがいします。 (Yoroshiku onegai shimasu)`. Lastly on our list, is `です` again, which means `I am` or `It is`. The reason why we're revisiting `です` in this lesson, is because I want to explain just how context based Japanese is as a language. Lets say you and your friend are hanging out and watching a movie or something similar, but you brought some snacks with you. As you guys watch the movie, you're eating the snacks that you brought over, and you want to offer your friend some snacks. In English, you would probably say something like `Do you want to eat some of this?` or `Do you want to try some of these snacks I brought?`, while holding up a snack for them to take. However, in Japanese, if you were holding up a snack for your friend to eat, you can simply say something like `たべる (Taberu)` with a rising intonation. `たべる` means `To eat`, so if you were to say that with a rising intonation, the sentence you said could literally be translated to `Eat?` and this is considered to be a complete and proper sentence in Japanese. That is how context-based Japanese is as a language. In this situation, it's obvious that you're talking to your friend, and if you're holding up food it's obvious what you mean for your friend to eat. So there is no need to specify your friend in the sentence, and there's no need to say `this`, as-in, the food that you're holding up. You simply omit them altogether, given the context. With this in mind, let's get back to `です` usage. If you were introducing yourself to somebody, a proper introduction could be soemthing like `はじめまして。タナーです。よろしくおねがいします。`. You start off the first sentence with `How do you do?`, then in the second sentence, you can simply say `[Your name]です`. Because you didn't add an honorific to the end of your name, and the fact that you say `Nice to meet you` right after, makes it obvious that you're talking about yourself. There is no need to say something like `わたしはタナーです。`, using `わたし` and `は` to set yourself as the topic of the sentence.",
                    "4": "Now that we are done with basic phrases, let's move onto japanese numbers and time. Let's start with numbers 0-10: `0(ゼロ OR れい / Zero OR Ree), 1(いち / Ichi), 2(に / Ni), 3(さん / San), 4(よん OR し OR よ / Yon OR Shi OR Yo), 5(ご / Go), 6(ろく / Roku), 7(なな OR しち / Nana OR Shichi), 8(はち / Hachi), 9(きゅう OR く / Kyuu OR Ku), 10(じゅう / Juu)`. Some things to keep in mind with these numbers. Firstly, you probably noticed that there are multiple ways to say a few of the numbers, like `よん`, `なな`, and `きゅう`. Most of the time, you will see them as I wrote them just now, and those alternative ways to say them usually change when talking about time. One exception to this would be `0` (`れい`), which is used just as often as and is interchangeable with `ゼロ`. Another thing to keep in mind, `に` is often pronounced as `にい` when it's said along other digits, like when reciting a phone number. `ご` is the same way when read alongside other numbers. Now that you know the first 10 numbers of Japanese, forming 11-100 is actually quite easy. To demonstrate this, lets go over numbers 11-19. `1` is `いち`, and `10` is `じゅう`, so that would make `11` `じゅういち (Juuichi)`. `2` is `に`, so that would make `12` `じゅうに (Juuni)`. `13` is `じゅうさん (Juusan)`, and so on up until you reach `20`. `14 (じゅうよん / じゅうし), 15 (じゅうご), 16 (じゅうろく), 17 (じゅうなな / じゅうしち), 18 (じゅうはち), 19 (じゅうきゅう / じゅうく)`. For the 20s, because `2` is `に` and `10` is `じゅう`, `20` is `にじゅう`. `26` would be `にじゅうろく`, and `29` would be `にじゅうきゅう`. `30` is `さんじゅう`, `40` is `よんじゅう`, `50` is `ごじゅう`, `60` is `ろくじゅう`, `70` is `ななじゅう`, `80` is `はちじゅう`, `90` is `きゅうじゅう`, and `100` is `ひゃく (Hyaku)`. In your required vocabulary, you learned about `さい`, which means `[...] years old`, and `じ`, which means `[...] O'Clock`. If you wanted to say that you are `23` years old, you could say something like `にじゅうさんです。 (Nijuusan Desu.)`. If you had a one year old brother or sister, you would say that they are `いっさい (Issai)`, which means `1 years old`. Notice how we did not say `いちさい`, since `1` is `いち`. This pronunciation is specific only to `1 years old`, and `いっぷん (Ippun)`, or `1 minute`. There are other numbers, too, that are the same way. `よん` becomes just `よ` when saying `よねんせい (4th year student)` and `よじ (4 O'Clock)`. `ろく` becomes `ろっ` when saying `ろっぷん (6 minutes)`. `はち` becomes `はっ` when saying `はっぷん (8 minutes)` and `はっさい (8 years old)`, and finally `じゅう` becomes `じゅっ OR じっ` when being used in `じっぷん (10 minutes)` and `じっさい (10 years old)`.",
                    "5": "Now, it's time to practice some new kana! This time, we're going to go over the N characters, W characters, and Y characters. Let's start with the hiragana:\n**N**: `な(Na) に(Ni) ぬ(Nu) ね(Ne) の(No)`\n**W**: `わ(Wa) を(Wo)(Pronounced as O)`\n**Y**: `や(Ya) ゆ(Yu) よ(Yo)`\nNow for the katakana:\n**N**: `ナ(Na) ニ(Ni) ヌ(Nu) ネ(Ne) ノ(No)`\n**W**: `ワ(Wa) ヲ(Wo)`\n**Y**: `ヤ(Ya) ユ(Yu) ヨ(Yo)`\nAs you can see, there are less characters in the `Y` and `W` sets compared to other kana that we've learned. These two sets are a bit of a special case. Let's first look at the `W` set. `ワ` and `わ` are used often in words, but because `を` is pronounced as `O`, you will never see this used to actually write words. That doesn't mean that it's never used, however, as `を` is used very often as a particle. We will go over this particle in a later lesson. Lets take a look at the `Y` set now. This set is a little bit special in the same way that the `つ/ツ` kana are special. Just like `Tsu`, a smaller version of any `Y` character can alter the way a word is pronounced. You've seen it quite a bit already in the basic expressions of this lesson. For example, in `いってらっしゃい`, it is pronounced as Itteras**sha**i.The presence of the `ゃ` turns `Shi` into `Sha`. If you were to put a small `ゆ` there, it would turn `Shi` into `Shu`, and a small `よ` would turn `Shi` into `Sho`. We are going to go over all of the possible combinations in a later lesson. For now, let's focus on some vocabulary to help you memorize these kana!\n`ゆめ (Yume)` - Dream\n`もや (Moya)` - Fog\n`よむ (Yomu)` - Read\n`ほね (Hone)` - Bone\n`このは (Konoha)` - Leaf\n`なにか (Nanika)` - Something\n`キャップ (Kyappu)` - Cap\n`ユーザー (Yuuzaa)` - User\n`ネクタイ (Nekutai)` - Necktie\n`ノート (Nooto)` - Notebook\n`ナッツ (Nattsu)` - Nuts\nThe length of this lesson is 3 days." 
                },
                "assignments": {
                    "{WT}oOgar7z9kjasg": "Write ナニヌネノワヲヤユヨ, and なにぬねのわをやゆよ 10 times on a piece of paper",
                    "{WT}oOvpawy89njca": "Write the following words in Japanese 5 times on a piece of paper: Dream, Fog, Read, Bone, Leaf, Something, Cap, User, Necktie, Notebook, and Nuts",
                    "{WT}oOeh0834LbJD9": "Write the following expressions in Japanese 5 times on a piece of paper and upload it: Good morning, Good afternoon, Good evening, Goodbye, Goodnight, Thank you, Excuse me, No, I'll go and come back, Please go and come back, I'm home, Welcome home, Thank you for the meal (before eating), Thank you for the meal (after eating), How do you do, I am, Nice to meet you",
                    "{WT}oO0k23lbfds93": "Write numbers 1-10 in Japanese 7 times on a piece of paper and upload it.",
                    "{VD}oOjfds91ja8zm": "Watch the youtube video linked below, and then type a 6-12 sentence summary in English on it.\nhttps://www.youtube.com/watch?v=AtUef8s8DeU",
                    "{VD}oO25msdv9jbt5": "Watch the youtube video linked below, and then type a 6-12 sentence summary in English on it.\nhttps://www.youtube.com/watch?v=pgQ49qOFEaI"
                }
            },
            "6": {
                "title": "The の Particle, こx、そx、あx, どx, The も Particle, R, & Final Kana Lesson",
                "assignmentCodes": [],
                "length": 2,
                "Pages": {
                    "1": "This is going to be a somewhat shorter lesson, as we learn about the `の` particle, some very important vocabulary, and finish up the rest of our kana. Let's start with the `の` particle. This is most often called `The Possessive Particle`. The point of this particle is to show that `Thing A` is owned by, or belongs to, `Thing B`. As an example, if you were to say `ノートはわたしのです。 (Nooto Wa Watashi No Desu.)`, that could be translated to `This notebook is mine.`. `ノート` meaning `Notebook`, `は` setting the notebook as the topic of the sentence, `わたし` meaning `I`, and `です` meaning `It is.`. The `の` in between `わたし` and `です` would mean that whatever `です` is, belongs to `わたし`. Another example is `ぼくのヒーローアカデミア (Boku No Hiiroo Akademia)`. In this sentence, `ぼく (Boku)` is a less formal way to say `I`, and `ヒーローアカデミア` means `Hero Academy`. So, this sentence would mean `My Hero Academy`. So, what if you want to say something like `This is her notebook.`, or `This is his notebook.`? The words for `He` would be `かれ (Kare)`, and the word for `She` would be `かのじょ (Kanojo)`, but you really shouldn't use these words for the sentence above. These words generally only mean `He/She` in Japanese writing, not when speaking to somebody. Most people, when you're speaking to them, will interpret `かれ / かのじょ` to mean `Boyfriend / Girlfriend`. This is just the most common usage of those words, so be careful how you use them. So, given that's the case, how do we say `This is his/her notebook.`? Well, if you know the person's name, you would use their name. So, the sentence could be `ノートはタナーさんのです。 (Nooto Wa Tanaa-san No Desu.)`, or, `This is Tanner's notebook`. You should always use the person's name if you know it, but if you don't know the person's name you could also use their title. So, if you're a student talking about your teacher's notebook, you could say `ノートはせんせいのです。`. Which means `This is our teacher's notebook`.",
                    "2": "We will speak a bit more about the `の` particle later in this lesson, for now though, let's go over some very important vocabulary. We'll start with the nouns `これ(Kore), それ(Sore), あれ(Are), and どれ(Dore)`. All of these nouns are ways to address a `thing`. `これ` means `This thing near me (The speaker)`, `それ` means `That thing near you (The listener)`, `あれ` means `That thing over there (Not near the speaker or listener)`, and `どれ` is a question word means `Which thing?`. Earlier in this lesson, we said `ノートはわたしのです。`. This works fine when it's obvious which notebook you're talking about, but what if there's lots of notebooks around? How would you alter this sentence to fit different scenarios? Well, if your friend picked up your notebook not knowing who's it is, you could say `それはわたしのです。(Sore Wa Watashi No Desu.)`, which means `That thing near you is mine`. Keep in mind, however, that it is generally impolite to refer to **people** as `これ`, `それ`, and `あれ`. The only times people really do this in a polite way, is when you're pointing a person in a photo, video, or something similar. If your notebook was on the desk at the front of the classroom while you and your friend are sitting towards the back of the classroom, and your friend asks you where your notebook is, you might say `あれはわたしのです。` and point to your notebook, which is away from both you and your friend. But, what if you want to specify that `the thing` you're talking about, is a notebook? What if it's not obvious that you're talking about notebooks? If that's the case, you can't use `これ / それ / あれ`, as these are only used as nouns. If you wanted to use these as adjectives, you could say `この(Kono), その(Sono), あの(Ano), and どの(Dono)`. These are how you would be more specific when describing the notebook you own. Let's say that you and your friend are cleaning up a room, and you want to let him know that the notebook on the table he's cleaning is yours. You might say `そのノートはわたしのです。(Sono Nooto Wa Watashi No Desu.)`. `そのノート` meaning `That notebook near you`. `この`, `その`, `あの`, `どの` all mean the same thing that they do in their `れ` forms, you just use them as adjectives instead. A bit more on `どれ` and `どの`, though. Since these are question words, you would not use the `は` particle when the topic is a question. For example, If you wanted to ask somebody `Which notebook is Tanner's?`, You would not say `どのノートはタナーさんですか。 (Dono Nooto Wa Tanaa-San Desu Ka?)`. You would instead say `どのノートがタナーさんですか。 (Dono Nooto Ga Tanaa-San Desu Ka?)`. Just keep this in mind for now, we will go more in-depth with the `は` vs. `が` particle in a later lesson.",
                    "3": "Lets look at how to describe places, now. These words would be `ここ`, `そこ`, `あそこ`, and `どこ`. While `これ` means `This thing near me`, `ここ` means `Here, near me`. `そこ` means `There, near you`, `あそこ` means `Over there`, and `どこ` means `Where`. "
                },
                "assignments": {}
            }
        }
    }
}